## 1  Sesi 6
EDA with Pandas

In [1]:
# colomb = feauture

In [2]:
#https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/property_data.csv

In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv('https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/property_data.csv')

In [5]:
df.head(10)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           --        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [6]:
#Standard missing values: missing value bisa dideteksi oleh Panda

In [7]:
df['ST_NUM']#lihat st_num

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [8]:
df['ST_NUM'].isnull()   #ditandai true = kosong

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [9]:
# non-standard missing values: pandas nggak tau (salahnya dari penulisan)

In [13]:
df['NUM_BEDROOMS']

0      3
1      3
2    NaN
3      1
4      3
5    NaN
6      2
7     --
8     na
Name: NUM_BEDROOMS, dtype: object

In [14]:
df['NUM_BEDROOMS'].isnull() #index ke 7&8 lepas dari pengawasan pandas

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: NUM_BEDROOMS, dtype: bool

In [15]:
# how to solve it?

In [16]:
missing_values = ['--','na','n/a','kosong','tidak diinput']

In [19]:
df = pd.read_csv('https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/property_data.csv',
                na_values=missing_values)

In [20]:
df['NUM_BEDROOMS']

0    3.0
1    3.0
2    NaN
3    1.0
4    3.0
5    NaN
6    2.0
7    NaN
8    NaN
Name: NUM_BEDROOMS, dtype: float64

In [21]:
df['NUM_BEDROOMS'].isnull() #sudah diperbaik

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7     True
8     True
Name: NUM_BEDROOMS, dtype: bool

In [22]:
# unexpected missing values: benar2 menguras waktu

In [24]:
df['OWN_OCCUPIED'] #index 3 is problem

0      Y
1      N
2      N
3     12
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

In [25]:
# how to solve unexpected missing value?

In [26]:
# pertama, looping

In [29]:
cnt = 0 #untuk index artinya count

for row in df['OWN_OCCUPIED']:
    try:
        int(row)
        df.loc[cnt,'OWN_OCCUPIED'] = np.nan
    except ValueError:
        pass
    cnt+=1

In [30]:
df['OWN_OCCUPIED']

0        Y
1        N
2        N
3      NaN
4        Y
5        Y
6      NaN
7        Y
8        Y
cnt    NaN
Name: OWN_OCCUPIED, dtype: object

In [31]:
# ambil keputusan: summarizing missing values

In [32]:
df.isnull().sum()

PID             2
ST_NUM          3
ST_NAME         1
OWN_OCCUPIED    3
NUM_BEDROOMS    5
NUM_BATH        2
SQ_FT           3
dtype: int64

In [33]:
df.isnull().values.any() #apakah masih ada data yang kosong di df

True

In [35]:
df.isnull().sum().sum()

19

In [36]:
# replacing (kosong data)

In [37]:
df['ST_NUM'].fillna(21,inplace=True)

In [38]:
df['ST_NUM']

0      104.0
1      197.0
2       21.0
3      201.0
4      203.0
5      207.0
6       21.0
7      213.0
8      215.0
cnt     21.0
Name: ST_NUM, dtype: float64

In [39]:
# replacing cell tertentu

In [40]:
df.loc[3,'ST_NUM'] = 310

In [41]:
df['ST_NUM']

0      104.0
1      197.0
2       21.0
3      310.0
4      203.0
5      207.0
6       21.0
7      213.0
8      215.0
cnt     21.0
Name: ST_NUM, dtype: float64

In [42]:
df.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0     PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0  LEXINGTON            N           3.0      1.5     NaN
2  100003000.0    21.0  LEXINGTON            N           NaN        1   850.0
3  100004000.0   310.0   BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0   BERKELEY            Y           3.0        2  1600.0

In [43]:
# replacing missing value -- again!

In [45]:
#teknik median,modus,

In [46]:
median = df['NUM_BEDROOMS'].median()
df['NUM_BEDROOMS'].fillna(median,inplace=True)

In [47]:
df.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0     PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0  LEXINGTON            N           3.0      1.5     NaN
2  100003000.0    21.0  LEXINGTON            N           3.0        1   850.0
3  100004000.0   310.0   BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0   BERKELEY            Y           3.0        2  1600.0

In [49]:
df.head(10)

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,Y,3.0,1,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,21.0,LEXINGTON,N,3.0,1,850.0
3,100004000.0,310.0,BERKELEY,NaN,1.0,NaN,700.0
4,NaN,203.0,BERKELEY,Y,3.0,2,1600.0
5,100006000.0,207.0,BERKELEY,Y,3.0,1,800.0
6,100007000.0,21.0,WASHINGTON,NaN,2.0,HURLEY,950.0
7,100008000.0,213.0,TREMONT,Y,3.0,1,NaN
8,100009000.0,215.0,TREMONT,Y,3.0,2,1800.0
cnt,NaN,21.0,NaN,NaN,3.0,NaN,NaN

## 1.1 Time Series

In [51]:
from datetime import datetime

In [55]:
date_rng=pd.date_range(start='1/01/2021', 
                       end='1/08/2021',
                       freq='H')

In [56]:
date_rng

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 01:00:00',
               '2021-01-01 02:00:00', '2021-01-01 03:00:00',
               '2021-01-01 04:00:00', '2021-01-01 05:00:00',
               '2021-01-01 06:00:00', '2021-01-01 07:00:00',
               '2021-01-01 08:00:00', '2021-01-01 09:00:00',
               ...
               '2021-01-07 15:00:00', '2021-01-07 16:00:00',
               '2021-01-07 17:00:00', '2021-01-07 18:00:00',
               '2021-01-07 19:00:00', '2021-01-07 20:00:00',
               '2021-01-07 21:00:00', '2021-01-07 22:00:00',
               '2021-01-07 23:00:00', '2021-01-08 00:00:00'],
              dtype='datetime64[ns]', length=169, freq='H')

In [57]:
df = pd.DataFrame(date_rng,columns=['date'])

In [58]:
df['data'] = np.random.randint(0,100,size=(len(date_rng)))

In [59]:
df.head()

                 date  data
0 2021-01-01 00:00:00    71
1 2021-01-01 01:00:00    63
2 2021-01-01 02:00:00    18
3 2021-01-01 03:00:00     4
4 2021-01-01 04:00:00    81

In [60]:
df.set_index('date',inplace=True)

In [61]:
df.head()

                     data
date
2021-01-01 00:00:00    71
2021-01-01 01:00:00    63
2021-01-01 02:00:00    18
2021-01-01 03:00:00     4
2021-01-01 04:00:00    81

In [62]:
string_date = ['June-01-2020','June-02-2020','June-03-2020']

In [63]:
string_date

['June-01-2020', 'June-02-2020', 'June-03-2020']

In [65]:
[datetime.strptime(x,'%B-%d-%Y') for x in string_date]

[datetime.datetime(2020, 6, 1, 0, 0),
 datetime.datetime(2020, 6, 2, 0, 0),
 datetime.datetime(2020, 6, 3, 0, 0)]